_/Chapter_10/PartG/Config/template.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/1999/XMLSchema"
                   xmlns="ItineraryProcessorIEP_iep">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <ItineraryStream_MsgObj>
            <GuestID>${GuestID}</GuestID>
            <FirstName>${FirstName}</FirstName>
            <LastName>${LastName}</LastName>
            <SeqID>${SeqID}</SeqID>
            <Source>${Source}</Source>
            <Destination>${Destination}</Destination>            
            <FoodPreference>${FoodPreference}</FoodPreference>
            <SeatPreference>${SeatPreference}</SeatPreference>
        </ItineraryStream_MsgObj>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
